# DataFrame

The object DataFrame of the package pandas represents a table of data. Each column is a Series; the columns share a common index.

In [1]:
# print all the outputs in a cell
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

import pandas as pd
import numpy as np

In [2]:
%autosave 0

Autosave disabled

## Create a DataFrame

### From cmd

In [3]:
pd.DataFrame({'Apples': [30], 'Bananas': [21]})

   Apples  Bananas
0      30       21

In [4]:
df_fruit = pd.DataFrame(
    {'Apples': [35, 41], 'Bananas': [21, 34]},\
    index=['2017 Sales', '2018 Sales']
)

In [5]:
df_fruit

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

### Write to a file

In [6]:
df_fruit.to_csv("fruit.csv")

In [7]:
ls

Module 04-DataFrame.pptx               module 4 -- data frame template.ipynb
data/                                  students.csv*
fruit.csv                              ~$Module 4 DataFrame.pptx
module 4 -- data frame complete.ipynb

### From a file

Place the data file in the same folder as the ipynb file. Then, read it as follows:

In [8]:
df = pd.read_csv('students.csv')

If the data file is not in the same directory, a good practice is to put it under a **sub-folder ./data/**

In [34]:
df1 = pd.read_csv('./data/students.csv')

In [35]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

By the default, the index is 0, 1, ...

Let us set the index as the column "Name".

In [10]:
df = df.set_index('Name')

In [11]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

Or use ...

In [12]:
#df=pd.read_csv('students.csv',index_col='Name')

## index, columns, values

<b>index</b> returns the index labels

In [13]:
df.index

Index(['Demetria', 'Dorian', 'Garland', 'Iluminada', 'Jeannine', 'Jenny',
       'John', 'Lucy', 'Mercy', 'Michael', 'Shelby'],
      dtype='object', name='Name')

<b>columns</b> returns the list of column names (as an index object)

In [14]:
df.columns

Index(['hw1', 'hw2', 'program'], dtype='object')

<b>values</b> returns a (2-dimensional) ndarray of values

In [15]:
df.values

array([[2.0, 4.0, 'MSIS'],
       [10.0, 10.0, 'MSIS'],
       [9.0, 1.0, 'MSIS'],
       [2.0, nan, 'MBA'],
       [6.0, 7.0, 'MSIS'],
       [8.0, nan, nan],
       [nan, 10.0, 'MSIS'],
       [7.0, 7.0, 'MSIS'],
       [5.0, 6.0, 'MSIS'],
       [6.0, 10.0, 'MBA'],
       [1.0, 10.0, 'MSIS']], dtype=object)

In [16]:
type(df.values)

numpy.ndarray

In [17]:
df.describe()

             hw1        hw2
count  10.000000   9.000000
mean    5.600000   7.222222
std     3.098387   3.192874
min     1.000000   1.000000
25%     2.750000   6.000000
50%     6.000000   7.000000
75%     7.750000  10.000000
max    10.000000  10.000000

In [18]:
df.program.describe()

count       10
unique       2
top       MSIS
freq         8
Name: program, dtype: object

In [19]:
df.describe(include='all')

              hw1        hw2 program
count   10.000000   9.000000      10
unique        NaN        NaN       2
top           NaN        NaN    MSIS
freq          NaN        NaN       8
mean     5.600000   7.222222     NaN
std      3.098387   3.192874     NaN
min      1.000000   1.000000     NaN
25%      2.750000   6.000000     NaN
50%      6.000000   7.000000     NaN
75%      7.750000  10.000000     NaN
max     10.000000  10.000000     NaN

## df.iloc[x, y]

Access using the positional index. 
<ul>
<li><b>x</b> is the information needed to select the rows: positional index or range of integers</li>
<li><b>y (optional)</b> is the information needed to select the columns: positional index or range of integers</li>
</ul>

Access one row by specifying a positional index

In [20]:
df.iloc[2,:]

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

In [21]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

Or, more simply:

In [22]:
df.iloc[2]

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

Access one column by specifying positional index of the column

In [23]:
df.iloc[:,1]

Name
Demetria      4.0
Dorian       10.0
Garland       1.0
Iluminada     NaN
Jeannine      7.0
Jenny         NaN
John         10.0
Lucy          7.0
Mercy         6.0
Michael      10.0
Shelby       10.0
Name: hw2, dtype: float64

Access one specific value

In [24]:
df.iloc[2,1]

1.0

Access a subset of rows and of columns

In [25]:
df.iloc[:5,-2:]

            hw2 program
Name
Demetria    4.0    MSIS
Dorian     10.0    MSIS
Garland     1.0    MSIS
Iluminada   NaN     MBA
Jeannine    7.0    MSIS

## df.loc[x, y]

Access using the index labels. 
<ul>
<li><b>x</b> is the information needed to select the rows: label index, range of index labels, or boolean masks</li>
<li><b>y (optional)</b> is the information needed to select the columns: label index, range of index labels, or boolean masks</li>
</ul>

Acccess one specific value by specifying index label and column name

In [26]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

In [27]:
df.loc['Garland','hw2']

1.0

Access one row by specifying index label

In [28]:
df.loc['Garland',:]

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

or, more simply:

In [29]:
df.loc['Garland']

hw1           9
hw2           1
program    MSIS
Name: Garland, dtype: object

Access one column by specifying index label

In [30]:
df.loc[:,'hw1']

Name
Demetria      2.0
Dorian       10.0
Garland       9.0
Iluminada     2.0
Jeannine      6.0
Jenny         8.0
John          NaN
Lucy          7.0
Mercy         5.0
Michael       6.0
Shelby        1.0
Name: hw1, dtype: float64

Or, more simply:

In [31]:
df['hw1']

Name
Demetria      2.0
Dorian       10.0
Garland       9.0
Iluminada     2.0
Jeannine      6.0
Jenny         8.0
John          NaN
Lucy          7.0
Mercy         5.0
Michael       6.0
Shelby        1.0
Name: hw1, dtype: float64

In [32]:
df.hw1

Name
Demetria      2.0
Dorian       10.0
Garland       9.0
Iluminada     2.0
Jeannine      6.0
Jenny         8.0
John          NaN
Lucy          7.0
Mercy         5.0
Michael       6.0
Shelby        1.0
Name: hw1, dtype: float64

Common mistake: get the whole row about Lucy

In [33]:
df['Lucy']

KeyError: 'Lucy'

In [37]:
df.loc['Lucy']

hw1           7
hw2           7
program    MSIS
Name: Lucy, dtype: object

Select those students whose name starts with 'J'

In [38]:
df.loc[(df.index >= 'J') & (df.index < 'K'),:]

          hw1   hw2 program
Name
Jeannine  6.0   7.0    MSIS
Jenny     8.0   NaN     NaN
John      NaN  10.0    MSIS

## Problems

#### Retrieve Shelby's hw1 grade

In [39]:
df.loc['Shelby','hw1']

1.0

#### Retrieve Shelby's information

In [40]:
df.loc['Shelby']

hw1           1
hw2          10
program    MSIS
Name: Shelby, dtype: object

#### Find all information about those students that obtained the highest grade in hw2. Note that there are ties

In [41]:
df.hw2.nlargest(1)

Name
Dorian    10.0
Name: hw2, dtype: float64

In [42]:
df.hw2.nlargest()

Name
Dorian      10.0
John        10.0
Michael     10.0
Shelby      10.0
Jeannine     7.0
Name: hw2, dtype: float64

So there are ties with grade equal to 10. Need to use .max() and boolean mask.

In [43]:
df.hw2.max()

10.0

In [44]:
df[df.hw2 == df.hw2.max()]

          hw1   hw2 program
Name
Dorian   10.0  10.0    MSIS
John      NaN  10.0    MSIS
Michael   6.0  10.0     MBA
Shelby    1.0  10.0    MSIS

#### Find those students who obtained the same score in hw1 and in hw2.

In [45]:
df[df.hw1 == df.hw2]

         hw1   hw2 program
Name
Dorian  10.0  10.0    MSIS
Lucy     7.0   7.0    MSIS

In [46]:
df.loc[df.hw1 == df.hw2]

         hw1   hw2 program
Name
Dorian  10.0  10.0    MSIS
Lucy     7.0   7.0    MSIS

#### Find the average hw1 score of those students who got a hw2 score greater than 5.

In [47]:
df[df.loc[:,'hw2']>5].loc[:,'hw1'].mean()

5.833333333333333

or ..

In [48]:
df[df.hw2 > 5].hw1.mean()

5.833333333333333

## sort_values()

Sort the table based on the values of a set of columns (parameter <b>by</b>).

Sorting by one column

In [49]:
df.sort_values(by='hw1', ascending=False)

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Jenny       8.0   NaN     NaN
Lucy        7.0   7.0    MSIS
Jeannine    6.0   7.0    MSIS
Michael     6.0  10.0     MBA
Mercy       5.0   6.0    MSIS
Demetria    2.0   4.0    MSIS
Iluminada   2.0   NaN     MBA
Shelby      1.0  10.0    MSIS
John        NaN  10.0    MSIS

Sorting by more columns. For example, by hw1 descending and, in case of ties, by hw2 ascending

In [50]:
df.sort_values(by=['hw1','hw2'],ascending=[False,True])

            hw1   hw2 program
Name
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Jenny       8.0   NaN     NaN
Lucy        7.0   7.0    MSIS
Jeannine    6.0   7.0    MSIS
Michael     6.0  10.0     MBA
Mercy       5.0   6.0    MSIS
Demetria    2.0   4.0    MSIS
Iluminada   2.0   NaN     MBA
Shelby      1.0  10.0    MSIS
John        NaN  10.0    MSIS

## sort_index

In [51]:
df.sort_index()

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

## head and tail

Returns the first (or last) n rows

In [52]:
df.head()

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS

In [53]:
df.tail()

         hw1   hw2 program
Name
John     NaN  10.0    MSIS
Lucy     7.0   7.0    MSIS
Mercy    5.0   6.0    MSIS
Michael  6.0  10.0     MBA
Shelby   1.0  10.0    MSIS

## Problems

#### Sort the MSIS students by hw2 descending.

In [54]:
df[df.program == 'MSIS'].sort_values(by='hw2',ascending=False)

           hw1   hw2 program
Name
Dorian    10.0  10.0    MSIS
John       NaN  10.0    MSIS
Shelby     1.0  10.0    MSIS
Jeannine   6.0   7.0    MSIS
Lucy       7.0   7.0    MSIS
Mercy      5.0   6.0    MSIS
Demetria   2.0   4.0    MSIS
Garland    9.0   1.0    MSIS

####  Show <b>only</b> the field <i>hw1</i> of the students with the largest hw2 grade

In [55]:
df[df.hw2==df.hw2.max()].hw1

Name
Dorian     10.0
John        NaN
Michael     6.0
Shelby      1.0
Name: hw1, dtype: float64

In [56]:
df[df.hw2==df.hw2.max()].loc[:,'hw1']

Name
Dorian     10.0
John        NaN
Michael     6.0
Shelby      1.0
Name: hw1, dtype: float64

## mean, min, max, etc

Aggregate functions are broadcasted to all columns (axis = 0, which is the default) or rows (axis = 1). Numeric aggregators will be executed only on numeric data.

The average for each hw

In [57]:
df.mean()

hw1    5.600000
hw2    7.222222
dtype: float64

The average for each student

In [58]:
df.mean(axis = 1)

Name
Demetria      3.0
Dorian       10.0
Garland       5.0
Iluminada     2.0
Jeannine      6.5
Jenny         8.0
John         10.0
Lucy          7.0
Mercy         5.5
Michael       8.0
Shelby        5.5
dtype: float64

In [59]:
df.max()

hw1    10.0
hw2    10.0
dtype: float64

## Problems

#### Compute the spread (i.e., highest minus lowest hw grade) of each student

let's try to use .max(axis=1) , find each row/student's max. Use .min(axis=1) to find the min.

In [60]:
df

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS

In [61]:
df.max(axis=1) - df.min(axis=1)

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    0.0
Jeannine     1.0
Jenny        0.0
John         0.0
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

Or

In [62]:
(df.hw1 - df.hw2).abs()

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    NaN
Jeannine     1.0
Jenny        NaN
John         NaN
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

In [63]:
(df.loc[:,'hw1'] - df.loc[:, 'hw2']).abs()

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    NaN
Jeannine     1.0
Jenny        NaN
John         NaN
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

What happen if the table has more than two homework columns ?

In [64]:
(df.columns > 'hw') & (df.columns < 'i')

array([ True,  True, False])

In [65]:
hw = df.loc[:,(df.columns > 'hw') & (df.columns < 'i')]

In [66]:
hw

            hw1   hw2
Name
Demetria    2.0   4.0
Dorian     10.0  10.0
Garland     9.0   1.0
Iluminada   2.0   NaN
Jeannine    6.0   7.0
Jenny       8.0   NaN
John        NaN  10.0
Lucy        7.0   7.0
Mercy       5.0   6.0
Michael     6.0  10.0
Shelby      1.0  10.0

In [67]:
spread = hw.max(axis = 1) - hw.min(axis = 1)
spread

Name
Demetria     2.0
Dorian       0.0
Garland      8.0
Iluminada    0.0
Jeannine     1.0
Jenny        0.0
John         0.0
Lucy         0.0
Mercy        1.0
Michael      4.0
Shelby       9.0
dtype: float64

#### Who has the largest spread?

In [68]:
spread.nlargest(1)

Name
Shelby    9.0
dtype: float64

Or... be careful there are ties

In [69]:
df_spread = df.max(axis=1) - df.min(axis=1)

In [70]:
df_spread.max()

9.0

In [71]:
df_spread[df_spread == \
          df_spread.max()]

Name
Shelby    9.0
dtype: float64

## Modifying DataFrames

Make a copy of the data frame

In [72]:
df1 = df

In [73]:
df1 is df

True

In [74]:
df2 = df.copy()

In [75]:
df2 is df

False

### Add rows

A new student has joined. His name is Oliver and he is the MSIS program; his hw1 is missing and his hw2 score is 8.

In [76]:
df2.loc['Oliver'] = [np.nan, 8, 'MSIS']

In [77]:
df2

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS
Oliver      NaN   8.0    MSIS

A new student has joined. Her name is Caroline and she got 4 in hw2. She is not in any program yet.

In [78]:
df2.loc['Caroline','hw2'] = 4

In [79]:
df2

            hw1   hw2 program
Name
Demetria    2.0   4.0    MSIS
Dorian     10.0  10.0    MSIS
Garland     9.0   1.0    MSIS
Iluminada   2.0   NaN     MBA
Jeannine    6.0   7.0    MSIS
Jenny       8.0   NaN     NaN
John        NaN  10.0    MSIS
Lucy        7.0   7.0    MSIS
Mercy       5.0   6.0    MSIS
Michael     6.0  10.0     MBA
Shelby      1.0  10.0    MSIS
Oliver      NaN   8.0    MSIS
Caroline    NaN   4.0     NaN

### Add columns

Add an "empty" column <b>hw3</b>

In [80]:
df2 = df.copy()

In [81]:
df2['hw3'] = np.nan

In [82]:
df2

            hw1   hw2 program  hw3
Name
Demetria    2.0   4.0    MSIS  NaN
Dorian     10.0  10.0    MSIS  NaN
Garland     9.0   1.0    MSIS  NaN
Iluminada   2.0   NaN     MBA  NaN
Jeannine    6.0   7.0    MSIS  NaN
Jenny       8.0   NaN     NaN  NaN
John        NaN  10.0    MSIS  NaN
Lucy        7.0   7.0    MSIS  NaN
Mercy       5.0   6.0    MSIS  NaN
Michael     6.0  10.0     MBA  NaN
Shelby      1.0  10.0    MSIS  NaN

### Add calculated columns

In [83]:
df2 = df.copy()

Let's add a column with the final grade. It is computed as 0.2\*hw1 + 0.8\*hw2.

In [84]:
df2['finalGrade'] = 0.2 * df2.hw1 + 0.8 * df.hw2
df2

            hw1   hw2 program  finalGrade
Name
Demetria    2.0   4.0    MSIS         3.6
Dorian     10.0  10.0    MSIS        10.0
Garland     9.0   1.0    MSIS         2.6
Iluminada   2.0   NaN     MBA         NaN
Jeannine    6.0   7.0    MSIS         6.8
Jenny       8.0   NaN     NaN         NaN
John        NaN  10.0    MSIS         NaN
Lucy        7.0   7.0    MSIS         7.0
Mercy       5.0   6.0    MSIS         5.8
Michael     6.0  10.0     MBA         9.2
Shelby      1.0  10.0    MSIS         8.2